In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv("../../Data/titanic.csv")

# We can use the transform method to fill missing values with the mean of a group.
## In specific cases, we can use the transform method to fill missing values with the mean of a group.

In [4]:
titanic["group_mean_age"] = titanic.groupby(by=['sex','pclass']).age.transform("mean")

In [9]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,group_mean_age
0,0,3,male,22.00,1,0,7.2500,S,NaN,26.507589
1,1,1,female,38.00,1,0,71.2833,C,C,34.611765
2,1,3,female,26.00,0,0,7.9250,S,NaN,21.750000
3,1,1,female,35.00,1,0,53.1000,S,C,34.611765
4,0,3,male,35.00,0,0,8.0500,S,NaN,26.507589
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.00,0,0,13.0000,S,NaN,30.740707
887,1,1,female,19.00,0,0,30.0000,S,B,34.611765
888,0,3,female,21.75,1,2,23.4500,S,NaN,21.750000
889,1,1,male,26.00,0,0,30.0000,C,C,41.281386
890,0,3,male,32.00,0,0,7.7500,Q,NaN,26.507589

In [8]:
titanic.age.fillna(value=titanic.group_mean_age)

0      22.00
1      38.00
2      26.00
3      35.00
4      35.00
       ...
886    27.00
887    19.00
888    21.75
889    26.00
890    32.00
Name: age, Length: 891, dtype: float64